uhnp/src/Catalogs/ПредметыКомментирования/ПредметыКомментирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПредметыКомментирования</name>
  <attributes>
    <name>РазделКомментариев</name>
    <type>
      <types>EnumRef.РазделыКомментариев</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/InformationRegisters/УниверсальныеКомментарии/УниверсальныеКомментарии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УниверсальныеКомментарии</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПакетФайлов</name>
    <type>
      <types>CatalogRef.ПапкиФайлов</types>
    </type>
  </resources>
  <dimensions>
    <name>ПредметКомментирования</name>
    <type>
      <types>CatalogRef.ПредметыКомментирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ЗначенияРеквизитовПредметаКомментирования/ЗначенияРеквизитовПредметаКомментирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияРеквизитовПредметаКомментирования</name>
  <dimensions>
    <name>РазделКомментариев</name>
    <type>
      <types>EnumRef.РазделыКомментариев</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредметКомментирования</name>
    <type>
      <types>CatalogRef.ПредметыКомментирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРеквизита</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ТипыРеквизитовКомментариев</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПоПорядку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗначениеРеквизита</name>
    <type>
      <types>Characteristic.ТипыРеквизитовКомментариев</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/ПредметыКомментирования/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
Процедура ПередУдалением(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	НаборЗаписей = РегистрыСведений.УниверсальныеКомментарии.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПредметКомментирования.Установить(Ссылка);
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	НаборЗаписей = РегистрыСведений.ЗначенияРеквизитовПредметаКомментирования.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.РазделКомментариев.Установить(Ссылка.РазделКомментариев);
	НаборЗаписей.Отбор.ПредметКомментирования.Установить(Ссылка);
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
КонецПроцедуры


#КонецЕсли
